---
kind: method
id: M:Autodesk.Revit.DB.CurveNode.GetCurve
source: html/9144ed8a-fad1-646f-9577-28bb6770bd61.htm
---
# Autodesk.Revit.DB.CurveNode.GetCurve Method

Returns the geometric curve object corresponding to the node.

## Syntax (C#)
```csharp
public Curve GetCurve()
```

## Returns
The curve.